#+TODO: TODO(t) NEXT | DONE(d!) DESISTIDO
#+BEGIN: clocktable :scope file :maxlevel 2
#+CAPTION: Clock summary at [2018-10-18 jue 13:44]
| Headline               | Time   |      |
|------------------------+--------+------|
| *Total time*           | *3:35* |      |
|------------------------+--------+------|
| 2018                   | 3:35   |      |
| \_  2018-01 enero      |        | 0:03 |
| \_  2018-03 marzo      |        | 0:01 |
| \_  2018-09 septiembre |        | 0:04 |
| \_  2018-10 octubre    |        | 3:27 |
#+END:

* 2016
** 2016-10 octubre
*** 2016-10-22 sábado
**** minuta de programacion                                 :programacion: 
:LOGBOOK:
CLOCK: [2018-10-10 mié 18:29]--[2018-10-10 mié 18:29] =>  0:00
:END:
 orgfile de relato o minuta de todos los items que vamos trabajando
 durante el trabajo con clock. entonces cumple una funcion doble es una
 lista de todos los items programados y las fechas.
 me saca la duda o sensacion de que carajo hice cada dia, en especial
 ahora que dedico la mañana y a la vez cuanto me lleva programar.
 hacer chunks de estudio y visitar el diario de desarrollo estarian
 incluidos en la tarea de programar, pq estarian dentro del mismo tema.
 se diferencia del diario de desarrollo que en el se debate lo que se
 va a hacer, y este registra lo que se hace, muy claramente en vim.
 ver si el clockeado en subtree se suma arriba
* 2018                                                                 :2018:
** 2018-01 enero
*** 2018-01-10 miércoles
**** problema tiempo libre cambio horario a la manana :problemaTiempo: 
:LOGBOOK:
CLOCK: [2018-10-15 lun 18:06]--[2018-10-15 lun 18:07] =>  0:01
:END:
  el problema de haber cambiado el horario es que no puedo pasarme el
 tiempo durmiendo excesivamente y luego pasar a ver netflix, y luego
 ir a dormir de nuevo. Tengo que hacer cosas productivas para
 justificar el cambio. Tampoco da por ahora la idea de salir, No estoy
 animicamente para eso. Por el momento creo que esta bueno que me
 inspire en hacer estas cosas que tengo que hacer y nunca hice.
*** 2018-01-11 jueves
**** experiencias luego de la lectura de Louse Hay :lecturas:estadoAnimico:RELEER:
:LOGBOOK:
CLOCK: [2018-10-15 lun 18:10]--[2018-10-15 lun 18:11] =>  0:01
:EN
***** "puedo cambiar" en medio del ejercicio
 en el capitulo de louise hay donde dice que el uso del espejo es
 fundamental para las afirmaciones en voz alta, pues es ahi donde
 veremos si creemos nosotros mismos en lo que supuestamente
 decimos. Esto retoma el famoso libro que lei en la decada del 80, que
 hablaba del metodo del espejo y yo no lo practique muy mucho. 
 Hoy hice la prueba con la afirmacion PUEDO CAMBIAR y no solo que pude
 hacerla con conviccion sino que en medio del ejercicio de tres series
 completo incluido el tercer ejercicio a rajatabla pude renovar fuerzas
 sin saber de donde salian y puedo decir que no hubiera completado
 nunca las tres series sin las afirmaciones.
 Y luego hice la primer serie de pushup.
***** sin la practica esos libros no sirven
 si no hacemos la practica no sirven.
 Es importante esa parte que dice que hay una necesidad dentro de
 nosotros para ser como somos sino atacamos esa causa no eliminaremos
 los efectos. Siempre estaremos solos, por miedo a la invasion en
 nuestras vidas de las otras personas y a la vez nunca cambiamos nunca
 hacemos nada en privado que sea realmente privado, o sea uno tiene
 miedo de perder esa privacidad que no aprovecha se podria decir
 (p.e. si vamos al caso de poder hacer gimnasia en mi caso, o de hacer
 un sistema de cambio por control mental por ejercicios que puedan
 parecer esotericos)
 Estuve pensando y no hice nada hoy que no hubiera podido hacer si
 hubiera estado en pareja, es mas hay cosas que me tienen eternamente
 trabado pq no estoy en pareja, como el mantenimiento del dpto (que no
 digo que me lo haga la pareja, pero mi parte seria mas facil hacerla
 si estuviera con otra persona) y la comida. 
 La escritura, la lectura, etc son temas privados que incluso siguen.
 Es una sensacion, como la sensacion de que hay quilombo en el dpto y
 nunca se termina de limpiar, o que hay muchas cosas por hacer y nunca
 se hacen. Parte pq se trabaja mal (p.e. el tema recibos y documentos
 esta mal y esta atorado pq se trabajo mal) 

 Igual el tema del dpto que hay muchisimas cosas que no se resuelven
 nunca en una minimalizacion que sea compatible con otras personas.
 Pero PUEDO CAMBIAR.
***** louise hay tiene la clave
 se que tiene la clave pq en las inseguridades propias y en la falta de
 amor por uno mismo esta la clave. Si uno no puede hablarse al espejo
 solo en su propia soledad imaginate si podra hablarle a los demas. Por
 eso pienso que debo continuar por ese camino.
*** 2018-01-13 sábado
****  Aplicacion de conceptos de Louse Hay :lecturas:
:LOGBOOK:
CLOCK: [2018-10-15 lun 18:19]--[2018-10-15 lun 18:20] =>  0:01
:END:
***** descubrimiento del poder de la mente                       :RELEER:
 me llama la atencion la idea de que "la mente es un instrumento que
 usted puede usar de cualquier manera como lo desee"
 "A medida que aprenda a controlar la mente eligiendo conscientemente
 sus pensamientos, ira ganandose como aliado ese poder"
 Y alli tengo dos ejemplos y un contraejemplo
****** Ejemplo oficina:
 Estaba tan mal que no queria ir mas a la oficina, me costaba
 levantarme y enfrentar otro dia de trabajo. Y leyendo un capitulo
 donde uno hacia un repaso mental de todos los lugares y cosas de la
 oficina e iba bendiciendolas a todas con el corazon, y cada una de las
 personas, incluso a la persona que en ese momento mas tenia cruzada
 que era CL la imaginaba que era eficiente y se comportaba en forma
 opuesta a lo que me molestaba, y la transformacion fue casi milagrosa
 y ha funcionado hasta el dia de hoy. Y solo cambio el pensamiento.
****** Ejemplo ejercicio:
 Luego de dos meses y medio de no hacer ejercicios, me encare a la idea
 de hacer las series de ejercicio con mucho esfuerzo pero en el medio
 de cada serie hacia una serie de afirmaciones en el espejo de "Puedo
 cambiar" y eso me dio energia suficiente para lograr las tres series
 completas y empezar los pushup, todo pienso que imposible sin ese
 aditamento.
****** Contraejemplo:
 el dia que fui al mercado norte y se me fueron los pensamientos en un
 espiral negativo cada vez peor y cuando llegue a casa a los cuarenta
 minutos tenia una migraña explosiva. Estoy seguro que si hubiera
 interrumpido el flujo de pensamientos y cambiado no habria pasado
 nada.
***** manejo del tiempo en el nuevo esquema horario
 por el momento tratando de transformar la realidad del dpto, como hice
 comenzando con la cocina, y pienso seguir con el tema documentos y el
 resto de las minimalizaciones.
 creo que mientras limite la duracion de la siesta para no interferir
 con la noche y solucionemos el problema de hacer con calor a la tarde
 total despues te das una ducha y listo se puede hacer un sistema de
 limpieza con poco esfuerzo o bien pasar la masa critica de  esfuerzo o
 de resultado que haga que luego sea agradable continuar y
 mantener. Igual con los minimos acomodos que hacen falta a nivel
 cables. 
***** entrenamiento mental
 creo que se puede comenzar un serio entrenamiento mental usando
 afirmaciones.
 he comenzado una dificil, muy dificil en mi caso apoyandome en un
 video y de ahi van surgiendo las trabas, como pq no quiero una
 relacion estable pq no quiero cosas que me aten o que puedan ponerme
 en estres, por eso las afirmaciones se van afinando bien precisamente
 a lo que quiero y son ayudadas con la visualidad.
 Recordando en tiempo presente, en positivo, con
 emocion. Reiteradamente. Antes de acostarme y al levantarme. Veremos
 cuanto tiempo demoramos en hacerlo realidad.
***** ejercicio con "ayuda mental"
 creo que lo demostre anteayer y el dolor muscular es prueba de que fue
 lo suficientemente intenso como para que sirviera. Ahora pienso que
 debo superar cierta "masa critica" para que empiece a crear musculo,
 eso va a costar mucho en mi caso. 
 Hace varios dias me da vuelta en la cabeza la pregunta Cuanto estarias
 dispuesto a dar para un resultado tan espectacular como ese cambio?,
 pq hacer un cambio para el cual ya estoy usando camisas mc sin
 camisetas abajo en solo dos meses solo por dieta, tendria que hacer un
 sacrificio.
***** rearmar el tema alimentario
 idem anterior es el tema dieta, felizmente hasta hoy me he mantenido
 dentro, salvo breves salidas que no llegan al 10% de lo permitido, con
 batata.
 Pero hay que reformar la dieta urgente para dar variedad.
** 2018-03 marzo
*** 2018-03-15 jueves
**** Louse Hey reflexiones sobre traumas infantiles             :lecturas: 
:LOGBOOK:
CLOCK: [2018-10-10 mié 18:50]--[2018-10-10 mié 18:51] =>  0:01
:END:
***** necesidad de pontificar u obtener lustre indirectamente
 o sea de hacerse odiar. O sea de resaltar cosas en las cuales siempre
 quedamos bien parados o mejor parados que los demas. O sea es una
 forma de busqueda de aprobacion externa que viene a ser buscada
 indirectamente.
***** necesidad de quejarse
 hay un articulo perfecto en el cuaderno donde describo el ideal que
 veria en ih si sirviera a proposito para mis quejas.
***** necesidad de dolor de cabeza o de tomar analgesico
 en especial frente a una crisis de nervios o a un imprevisto que me
 saque de la rutina
***** necesidad de hacer "competir" por el amor o la atencion
    con un placer perverso de mirar al que esta "perdiendo" la atencion. Este 
    recurso que es ampliamente usado en las peliculas y series.
    P.e. en serie Amor S01E03 donde Mickey ve a Gus que atrae la atencion de 
    otra chica y ella aparentemente se queda mirando de afuera. Y eso explota 
    la perversa cuestion dentro de muchos de nosotros de no solo "hacer 
    competir por el amor" sino de mirar sadicamente al perdedor como diciendo 
    mira lo que te perdiste. Esto que creo que es algo enfermo, debe provenir 
    de la infancia en una etapa en que a uno lo deben haber desplazado en un 
    contexto de amor limitado, siendo que el amor hubiera podido alcanzar para 
    todos. Y de mayor uno tiende a beneficiar mas a uno que a otro. Y a gozar 
    con sadismo de esas diferencias.
***** vivencia de no ser amado
***** vivencia de tener que dejar mi proyecto en favor de un familiar
***** vivencia de que no era dado ni siquiera desear algo
***** vivencia de invisibilidad
** 2018-09 septiembre
*** 2018-09-12 miércoles
**** sensacion de estar atrapado                                :libertad:
:LOGBOOK:
CLOCK: [2018-10-07 dom 19:41]--[2018-10-07 dom 19:42] =>  0:01
:END:
  En un video que vi ayer de Mujica ex presidente del Uruguay decia que si 
  bien es cierto que necesitamos algunas cosas materiales tambien necesitamos 
  libertad. Y eso me recuerda lo que decia Nietzche que si uno no dispone de 
  la mitad de su jornada para uso propio y para su propio beneficio es un 
  esclavo por mas que la gente lo conozca a uno o lo reconozca como medico o 
  abogado o ingeniero. (Ni que hablar tiene que ni siquiera "gozemos" ese 
  reconocimiento y seamos unos tristes pelagatos que pasemos toda nuestra vida 
  encerrados no solo dentro de una oficina, sino dentro de unos esquemas 
  horarios y contractuales que nos asemejen mas a unos esclavos que a unos 
  hombres libres y todo porque?). Cuando fue la ultima vez que pude disponer 
  de un solo puto dia para mi mismo con total libertad??
  recuerdo aquellos dias del 88 cuando me sentaba en el bar 
  todos los dias a tomarme una tonica y pensaba que lindo seria hacerlo a esto 
  siempre y en realidad no lo hice nunca mas.
  Pero luego reflexione que en realidad uno se carga de obligaciones que no 
  son obligaciones en si mismas sino que son supuestamente cosas que hace por 
  gusto, pero que terminan por aprisionarlo a uno lo mismo.
  Hoy creo que el esquema que me atrapa es mas asfixiante o el torniquete es 
  mas apretado que en otro momento. pq tengo en realidad una obligacion 
  publica real que termina aca tipo 20.30 o mas y cansado pq tengo que ver que 
  ceno. Pero eso no ha significado que el dia se ha liberado, al contrario, 
  muy al contrario, el dia comienza a las 8hs pq tengo que levantarme si o si 
  a acondicionar el dpto que ya al dejar de pertenecer a mi esfera privada pq 
  paso a ser parte de romitex, tengo la obligacion de levantarme a limpiar y 
  mantener ordenado, luego tengo que "correr" por hacer alguna que otra tarea 
  hasta que venga la Cami pq como hay una sola compu si no la hago en ese 
  momento no la puedo hacer despues, luego viene el intermedio tedioso de 
  esperar que la Cami cumpla su turno, pq no tengo compu como para trabajar en 
  algo util, tengo la notbook que mas que para escribir aca no sirve, y 
  tenemos el tremendo problema de la espalda con la silla que ya a pocos dias 
  me esta trayendo problemas de espalda. Y no es solo eso sino la falta de 
  libertad de movimiento dentro de esas horas. Luego comer cualquier basura, y 
  tener que hacer una tarea que no es poca. (Aca vale la pena aclarar que a 
  hoy me saco de encima la obligacion de procesar romitex fichas pq pienso que 
  va a ser dejado de lado pq no va a ser productivo, pero eso me estaba 
  llevando una hora o mas por dia en ese horario critico). Y luego vendria una 
  hora o hora y media que podria ser usada como siesta si no fuera que uno 
  debe tomar multiples consideraciones, el telefono de la oficina, el celular 
  propio, etc. o sea no es cuestion de decir que me acuesto y tengo super 
  siesta, y no es tampoco que se puede dormir aca en el centro. y a correr a 
  la oficina.
**** sensacion de encierro en mi dpto transformado en oficina :problemaCami:libertad:
:LOGBOOK:
CLOCK: [2018-10-07 dom 19:45]--[2018-10-07 dom 19:47] =>  0:02
:END:
   para entender el momento hay que ver que pasaba en el momento ese que 
   surgio el malestar y que paso luego cuando supuestamente aflojo un poco el 
   malestar.
   Estaba muy fiacudo en lo que respecta a salir a la calle, me habia vestido 
   directamente con fajina (eso que pudo haber sido bueno para limpiar, no fue 
   bueno como incentivo para salir), no habia sido una mañana que hubiera 
   tenido que limpiar mucho, el mantenimiento del limpio sobre limpio del 
   dormitorio me fue muy facil, incluyendo abrir para ventilar y limpiar con 
   blem y barrer, o sea no fue eso, platos casi no habia, y el resto no lo 
   toque, pero tuve fiaquento como para plantearme salir a la calle a hacer 
   los pendientes.
   Entonces me quede pero no me encontraba con un lugar, y si me sentaba 
   en la mesa me dolia la espalda y para mi adentro me decia que bajon tener 
   que soportar esta silla o bien que seguir con esta silla me va a romper la 
   espalda. Por eso no escribi mucho que digamos, ademas "perdi" mas de media 
   hora comprobando los recibos de ayer, y no empeze a programar que era lo 
   que tenia que hacer. y mas me dolia la espalda.
   A su vez estaba inapetente y tenia ganas de cagar que me estaba 
   conteniendo.
   me fui a acostar un rato a la pieza horizontal, y me agarraron los 
   temblores mal, eso que estaba fijo en una posicion neutra, y luego cuando 
   me vine a la cocina donde me quede los temblores siguieron. Eso sumo una 
   gran preocupacion. 
   Y en general todo, el verme reducido en movilidad, el tener ayuda, pero a 
   la vez reducirme yo en lo que puedo hacer "mientras" se hace esa tarea 
   termina por hacerme una imagen de agobio multiplicado por dos. Y la 
   sensacion de no poder salir.
   Y en el medio es donde pense en renunciar, en salirme, en pensar cosas que 
   decia Dario Z. mientras comia, o sea en equis dias estare muerto, y si 
   querre haber pasado estos dias asi. Lo mal que me hace estar asi. 
   Y tambien que tengo que seguir viviendo, que no puedo rifar el patrimonio 
   de las chicas, o sea lo mismo de siempre. 
   y comi mi arroz de mierda mientras escuchaba a dario z. y comi un flancito, 
   y luego me puse a imprimir y luego se me acabo el toner, y me cambie la 
   camisa y sali sin problemas a comprarlo y no paso nada. 
   No me acuerdo ahora que quiero relatar lo sucedido, cuales fueron los 
   vectores reales que me llevaron a la sensacion de ahogo y cuales fueron las 
   que me liberaron, pienso que el solo hecho de que la Cami se vaya cuando 
   termina su jornada y quede solo en el dpto ya es liberador para mi. Pero de 
   la carcel mayor no puedo librarme.
*** 2018-09-18 martes
**** pruebo con beroca                                         :cansancio:
:LOGBOOK:
CLOCK: [2018-10-07 dom 19:56]--[2018-10-07 dom 19:57] =>  0:01
:END:
 hoy amaneci bastante normal, decidi no hacer la rutina de hacer la cama ni 
   limpiar sino ir haciendo algo de oficina y me puse a sacar boletas a pagar 
   y contar. Luego llego la Cami, la puse que me ayudara a contar, y luego la 
   deje pasando recibos y empece a pagar cuentas, con la intencion de meter 
   cambio, yendo a tres rapipagos, uno de ellos pagofacil por el tema telecom, 
   me senti agotado en el medio pero contento al fin. Pague todo, y tambien 
   fui a farmacity y compre alimento, prepare el almuerzo y comimos juntos, 
   luego hice la caja, o sea como dia de trabajo rindio bastante bien, y fue 
   un dia de salir a la calle varias veces. Me senti muy comodo saliendo a la 
   calle, totalmente opuesto al malestar del 12/9. No se si influyo el clima, 
   o tambien influyo el cambio en los procesos que estamos llevando a
   cabo. 

** 2018-10 octubre
*** 2018-10-07 domingo
**** domingo en familia de nuevo con dolor                       :migraña:
:LOGBOOK:
CLOCK: [2018-10-07 dom 19:28]--[2018-10-07 dom 19:35] =>  0:07
:END:
Nuevamente como paso en anteriores domingos luego del asado que se
presento con mas o menos ansiedad o nerviosismo la intensidad extrema
del resplandor (necesitaria traerme los lentes de sol) hace que me
afecte si ya el dia se presento migranoso, y hoy me habia levantado a
las 4 am a tomar un M. Aunque habia avisado que me iba a retirar a
dormirme una siesta en el aire, y el vientito estaba lindo y me pude
aislar comodamente un rato largo no fue excento de ansiedad y estallo
una nueva migrana y termine tomando otro M y se me paso felizmente
pero cuando me levante y tome un cafe al rato se fueron pq los chicos
estaban cansados y a la Mayra le dolia la cabeza y le tenia que hacer
la tarea al Lolo. Es muy intenso estar varias horas con esos chicos y
mas si es a la siesta. Es muy desgastante y mas si uno quiere hablar
temas de negocio, no es factible querer discutir temas de negocio
durante un almuerzo familiar, pq le quita la familiaridad que debe
tener todo y eso no sirve.
**** De que tratara el diario jornales y como estara organizado :jornales:
:LOGBOOK:
CLOCK: [2018-10-07 dom 20:00]--[2018-10-07 dom 20:07] =>  0:07
:END:
 Se trabajara con capturas, las Capturas se hacen de cualquier lado
 con C-0 zero. Las acomoda automaticamente en jornales.org de orgblok,
 y en un datetree organizado por ano/mes/dia, salvo que lo llamemos
 con C-1 C-0 que nos da el calendario para elegir el dia que queremos
 trabajar. automatico inserta un clockin/clockout para poner un
 registro de cuanto tiempo tuvimos en la entrada, lo cual podremos
 sumarlo si queremos en una tabla inicial. Y nos pide un tag, el tag
 es importante, pq justamente la idea es mezclar todo en el jornal,
 como en cada dia habra muchos post de distintos temas, la bocha
 estara en no solo titular los posts sino tagearlos, o sea que el tag
 es lo mas importante pq eso luego con un sparse-tree permitira
 seleccionar una parte del org que queramos leer. Como puse que
 podemos seleccionar solo tags del mismo archivo eso es mas facil pq
 facilita la seleccion.
**** TODO trasvasar todo .dek a jornales                        :jornales:
:LOGBOOK:
CLOCK: [2018-10-07 dom 20:07]--[2018-10-07 dom 20:11] =>  0:04
:END:
 al menos .dek habria que pasarlo se puede ir leyendo parte por parte
 para ver que tag asignar
*** 2018-10-08 lunes
**** Ya asumio que no trabaja mas conmigo                   :problemaCami:
:LOGBOOK:
CLOCK: [2018-10-08 lun 15:40]--[2018-10-08 lun 15:41] =>  0:01
:END:
 Por lo menos hemos hablado y seguimos en buena relacion y de paso yo
 me libero de esa presion que he venido analizandola en los anteriores
 post y hoy a la mañana analice bien con ih, lo bueno de todo esto que
 no afecte la relacion con ella, y si ahora ella tiene trabajo con la
 Romi mejor.
*** 2018-10-09 martes
**** ultra dispositivo para dormir                              :insomnio:
:LOGBOOK:
CLOCK: [2018-10-09 mar 09:10]--[2018-10-09 mar 09:16] =>  0:06
:END:
 anoche luego de un dia muy intenso, pero que dentro de todo lo lleve
 bien pq aunque me vine tardecito del marques como todo lunes
 mayormente no me puse nervioso, y solo apele a una SL cuando la cami
 me mando WApp diciendo que entraba a la tienda Levi y me empezo a
 mandar fotos de los jeans que se estaba probando, hasta que dijo que
 no habia encontrado lo que queria y luego que si la dejaba comprarse
 uno de 800 pesos. Al final la mañana y el dia terminaron con medio
 migral, a pesar que no tuve siesta, solo me recoste una media hora
 que no dormi pq no quise casi pq me puse a leer emacs. Pero era
 grande la modorra, pero se fue con gran cafe, luego de levantarme e
 irme a la oficina y atender a toda la gente. Luego cuando llego la
 hora de dormir, para no tener problemas de insomnio ni dormir mal, me
 puse dos SL juntas (la primer vez que lo hago) y dormi joyita hasta
 las tres que me levante al baño, y ahi me puse otra y tire hasta casi
 las 8 que sono el despertador. Al menos en un contexto de ansiedad
 (pero ansiedad de la buena, esa ansiedad emacsiana) pude dormir bien
 pq vengo de varios dias sin dormir bien.
**** fui a pagar dpto y de nuevo la bruja de la Maria       :dpto:matetes:
:LOGBOOK:
CLOCK: [2018-10-09 mar 11:18]--[2018-10-09 mar 11:23] =>  0:05
:END:
 me pregunta por si tengo pagados los honorarios!!!! imaginarse a mi
 se me pararon los pelos de punta pq los honorarios me los cobro en
 negro el pelotudo del "doctor" merlo y esta pelotuda pregunta. Menos
 mal que la deje pasar, pq la mina estaba como sobreexaltada debe ser
 por el quilombo en que se encontro al volver y para volver a poner
 todo de nuevo en orden despues de tres meses. 
Lo patetico de todo es que ya pago el 4to mes de alquiler y no arregle
 el caño de la cocina, y ya pienso en mudarme. Tendria que agregar
 este tema a matetes.
**** altibajo animico durante el fin de semana      :estadoAnimico:findes:
:LOGBOOK:
CLOCK: [2018-10-09 mar 12:09]--[2018-10-09 mar 12:15] =>  0:06
:END:
Mirando en retrospectiva los findes, en especial el ultimo siempre me
agarra un arrepentimiento sobre mis actitudes pq no me explico pq tuve
ciertos momentos en los cuales parezco no disfrutar el momento
presente con alegria. Luego que vinieron los chicos y estaba sentado
con el Fede en vez de disfrutar el momento ahi con el hablando de lo
nuevo, me puse agresivo tocando un tema que no venia al caso o sea los
errores de venta, sabiendo que eso era algo que lo iba a poner mal, y
que ni siquiera lo habia chequeado yo, todo pq no pude estar atento al
finde, igual con el tema de llevarla a la Cami a su salida cosa que no
me lleva mas que media hora y no me cuesta nada, y todo pq en el fondo
siempre tengo como una actividad pendiente que hacer que supuestamente
lo que viene o sea el momento presente viene a "interrumpir" en este
finde fue la emacsiada. Y en el pasado tambien. Los otros anteriores
fue la filosofia y la lectura. Lo llamativo es que estando en mi casa
no dejo de hacer otras cosas como dormir la siesta por eso, -bueno a
veces si- Pero creo que es algo que hay que cambiarlo. 
**** soy una maquina de quejas                           :ih:matetes:dpto:
:LOGBOOK:
CLOCK: [2018-10-09 mar 12:39]--[2018-10-09 mar 12:44] =>  0:05
:END:
estaba atorado pasando un millon de recibos y tenia la cocina con olor
a podrido pq no lave los platos el viernes al irme y ayer lunes
tampoco, y voy haciendolos de a poco, y entre en panico, pq pense me
falta una hora de planillas imprimir, y me queda la planilla del mes
de caja, contar la plata y demas no llego a una minima siesta y este
lio, pensaba en la Cami, pero me dije textualmente la Cami es una
inutil no me sirve, e internamente pensaba lanzarle toda esa queja a
ih. Y hace un rato pensaba que cada vez que fui a pagar el alquiler y
estaba Maria la considero una candidata a que me escuche quejas, o sea
soy un bicho que se queja, o sea un cincuenton quejoso, pobre de la ih
que su funcion es escucharme y yo no la quiero escuchar pq solo quiero
quejarme de todo. Al final me puse y en dos minutos, lave las dos
ollas que podian estar podridas y me saque el reloj y puse un balde
con procenex y pase el piso de la cocina y listo, no tarde mas de
cuatro minutos. 
**** me quede sin la siesta por ahora                           :libertad:
:LOGBOOK:
CLOCK: [2018-10-09 mar 19:40]--[2018-10-09 mar 19:42] =>  0:02
:END:
Es por el trabajo, pq durante el horario en que me aislaria por motivo
de la siesta p.e. Fabian me pidio dos cuentas nuevas y al final es
cuestion de costumbre, me quedo leyendo aunque descansando quizas en
un tiempito con aa y luego me cambio tomo un cafe y me vengo a la
ofi. Y luego duermo bien a la noche.
*** 2018-10-10 miércoles
**** segunda noche con ultradispositivo y sin siesta            :insomnio:
:LOGBOOK:
CLOCK: [2018-10-10 mié 08:39]--[2018-10-10 mié 08:43] =>  0:04
:END:
dos SL y caigo redondo sin musica y duermo total, a pesar de que
anoche me despierto raro a las 2.30hs cuando es la hora del primer
pis, y pienso que tengo gases, doy unas vueltas por la cocina para
tomar un poco de agua, le echo la culpa a la gaseosa, y me sale vomito
de ... arroz yamani en seco!! horrible, al respiro fui a tomar agua al
menos que saliera mas fluido pero no salio nada y no jodio mas nada,
y segui durmiendo joya y sin tomar una tercera SL como habia hecho la
primera noche del ultradispositivo
**** atoramiento de tareas atrasadas en ciertos momentos    :matetes:dpto:
:LOGBOOK:
CLOCK: [2018-10-10 mié 08:44]--[2018-10-10 mié 08:53] =>  0:09
:END:
Anoche salia de la oficina chocho, gozando de que la oficina esta
linda, y que la jornada no habia sido tan mala y me disponia a
disfrutar de la peatonal, cuando me llama el Fede para decirme que iba
a venir a buscar plata... O sea me entra un suceso externo. Ahi me
cambia todo el panorama. A la mierda la bucolicidad de la peatonal,
regreso a mil, y decido ir al super a comprar queso al menos, pq
cuando abro la puerta del vestidor explotaron como veinte polillas un
desastre, no se que mierda pasa con eso. Y me fui al super, menos mal
que no habia mucha gente pq encima me iba a malquistar. Y solo compre
queso para hacerme un arroz, y no tenia queso, y compre una paso de
los toros  pq antipolillas no habia, y debo decir que antes me tome
una SL pq la situacion era superestresante. Lo que debo averiguar si
es que me produce urticaria que me visiten (ya sea el Fede, la Cami, o
quien sea), o lo que pienso yo que es la razon que el dpto sea un
desastre de mugre y desacomodo y que ni siquiera tenga vasos limpios o
sea que el estado de problematica de dpto ya excedio lo normal. o sea
que estamos en esa situacion que describi a esa prospecto de
limpiadora que atendi en la oficina no tener un dpto para recibir
gente en condiciones, o me molesto pq las visitas me sacan de mi plan
original que pueda ser comer, leer etc. Yo me inclinaria por el
segundo en estos momentos. 
**** ataque ansiedad al volver del banco                        :ansiedad:
:LOGBOOK:
CLOCK: [2018-10-10 mié 11:20]--[2018-10-10 mié 11:24] =>  0:04
:END:
causado por la avalancha de cosas por hacer. Todo pq veo una TB9 justo
al doblar en gama y me doy la vuelta y veo que corre a la parada del
42 rumbo a mosconi, y luego subo mascullando bronca, y encuentro el
dpto tufado y lo considero no apto para nada, y ahi pienso que un
objetivo seria tener el dpto apto. Falta mucho en todos los sentidos,
pero principalmente poner al dia los papeles, veo los papeles sobre la
mesa, tengo que contar la plata, hacer la caja, pasar las ventas, etc
y el calor insoportable, me tomo una SL y caigo en ansiedad, luego se
me va a pesar de la mala noticia que me da ih sobre que la Romi
abandona la idea de la enseñanza y entra en crisis personal ella misma.
**** dolor implantes inf. derechos                    :sintomas:implantes:
:LOGBOOK:
CLOCK: [2018-10-10 mié 13:16]--[2018-10-10 mié 13:19] =>  0:03
:END:
anoche mientras comia el arroz senti una sensacion de dolor no
dentaria tipo carie pero si como inflamatoria alrededor de la encia,
pero luego me fui a dormir, y a la mañana cuando me lave los dientes
me molesto un poco y luego paso. 
**** sigo con el tic de empujar con la lengua           :sintomas:dientes:
:LOGBOOK:
CLOCK: [2018-10-10 mié 13:19]--[2018-10-10 mié 13:21] =>  0:02
:END:
hasta producir dolor en las protesis en distintos lugares, y me tomo
otra SL para evitar el nerviosismo que me lleva a hacer eso no quiero
tener problemas por culpa de eso.
**** objetivo concentrarse en org-mode unicamente                :estudio:
:LOGBOOK:
CLOCK: [2018-10-10 mié 15:30]--[2018-10-10 mié 15:38] =>  0:08
:END:
lo que veo que es que si me concentro en eso solo puedo realmente ir
buscando la forma de que podamos gestionar de otra forma el tiempo y
las cosas para ser mas eficientes. pq no queda otra. Cada capacidad
que uno adquiere y domina pasa a otro nivel. No hablemos de dominar
bien, P.e. las capturas ya son un paso genial que o tenia antes y creo
que estan limitadas a la imaginacion. Y hay muchisima documentacion al
respecto.
El tema tablas tambien y falta repasar el tema formulas y calculos, y
el tema busquedas, agendas etc etc.
Obviamente todo va a ser mas operativo con el uso continuo. pq el uso
hace a la funcion. 
**** estoy enviciado con emacs/orgmode                   :bitacoraOficina:
:LOGBOOK:
CLOCK: [2018-10-10 mié 20:10]--[2018-10-10 mié 20:14] =>  0:04
:END:
En todo momento estoy con lo mismo, y aunque atiendo bien a la gente y
me paso el dia trabajando pasando los papeles y produciendo lo que
hace falta, pero no me queda tiempo para las cosas diarias en mi casa,
y para el relax, y todo tiempo libre lo paso o bien leyendo cosas de
emacs o bien haciendo posteos (que no es algo malo en si pq son
posteos de la situacion en que me siento en momento presente) y lo
malo es que creo que la emacmania o la orgmania me da la sensacion o
me agrava la sensacion de falta de tiempo, pero en realidad la falta
de tiempo la tengo igual, y esto en realidad lo que hace es a la larga
beneficiarme y ayudarme a organizarme y me da la posibilidad de
aprender algo.
*** 2018-10-11 jueves
**** resolucion de algunos matetes         :matetes:ansiedad:problemaCami:
:LOGBOOK:
CLOCK: [2018-10-11 jue 13:20]--[2018-10-11 jue 13:27] =>  0:07
:END:
hoy reincorpore a la Cami para que pase los papeles pq estoy
desbordado de pasar yo mismo la pila de papeles, en ese interin limpie
a fondo la habitacion y planche tres camisas. Y no tuve ansiedad ni
tuve necesidad de tomar ningun SL. veremos como sigue la cuestion. Lo
que me plantie en el fondo fue que si ella pasaba los recibos y
fechaba yo si queria podia controlar en pocos minutos en la compu, no
en listado que es un dolor de bolas, y el fechado en el fondo lo puede
hacer ella cortandome las cosas que son mas relevantes. Y tambien que
con el sistema de pendrive puedo yo a la tarde cuando me van dando las
planillas ir pasando lo relevante o ir ojeando lo relevante y
pasandololo yo, o bien separandolo yo, igual a la noche cuando llegue
y dejar lo rutinario que lo pase ella. Igual el imprimir intimaciones
puedo hacerlo en la oficina. O sea menos trabajo en la casa, mas
trabajo en la oficina. Y pongo mi vida al dia que de otra forma no se
va a poner al dia y va a ir rumbo al colapso. 
**** hoy disminucion de ansiedad                       :ansiedad:insomnio:
:LOGBOOK:
CLOCK: [2018-10-11 jue 15:29]--[2018-10-11 jue 15:36] =>  0:07
:END:
Empezo anoche cuando vine de la oficina. Me puse a cambiar el sistema
operativo!!! pq no me andaba la impresora, lo cual habia sido un
embole mayusculo por la tarde ya que imaginarse que la impresion es
algo basico en mi sistema. Vi alguna hp y no bajaba de 16k!!!. Ni
siquiera pude terminar de imprimir los recorridos. Al final decidi
cambiar por Solus. Y me tire a la pileta!!, empece y no cene, tome
medio litro de licuado y termine a las doce y cuarto con unos
problemas resueltos barbaros con tcl y python, que son totalmente
atipicos. La impresora ni hablar. 
Me tome dos verdes, y a dormir, dormi muy bien, pero con medio a la
noche tipo cinco, con tecito y dos coquitas, y segui hasta las
9.40!!!! pq no habia puesto el despertador. Lo cual estuvo joya. Ahi
me escribe la Cami y yo con muy buen humor le digo que si que venga a
desayunar conmigo que le iba a dar la mesada. Una vez desayunando
tranquilos como que era sabado o domingo, eran las 10 y media casi, le
propongo que vuelva a trabajar, y la pongo a pasar los recibos, y yo
me pongo a limpiar la habitacion y a planchar. Y no senti ansiedad,
incluso la invite a la Romu, y tuve energia para lavar los platos, y
encarar la limpieza que falta. (El dia ayuda y el nivel de energia que
yo tenia tambien.) Luego me aboque a instalar la impresora y lo logre
sin demasiadas complicaciones aunque no a la primera instancia, y ya
tengo el sistema de nuevo en funcionamiento. 
**** organizacion de la jornada con la Cami trabajando              :dpto:
:LOGBOOK:
CLOCK: [2018-10-11 jue 15:37]--[2018-10-11 jue 15:43] =>  0:06
:END:
Pienso que si ella pasa lo grueso o sea los recibos, las ventas, y los
fechamientos, y encarpeta las ventas, me saca un gran trabajo de
encima, y aparte la mando a comprar, tanto al super, como la comida,
como las hojas y el toner, o sea es mucha la ayuda que tengo. Y de
paso la tengo aca conmigo.
Yo por lo pronto quiero empezar a limpiar el dpto, esa sera la primer
estrategia y el primer objetivo y a descansar mas. 
**** sigue molestia en molar implantado derecho       :sintomas:implantes:
:LOGBOOK:
CLOCK: [2018-10-11 jue 19:55]--[2018-10-11 jue 19:59] =>  0:04
:END:
en el area de la encia alrededor, como si se hubiera inflamado con el
cepillo o bien un proceso. Voy a aprovechar el sabado que vaya a
pagarle al doc para consultar
*** 2018-10-12 viernes
**** segundo dia de sistema :ansiedad:hijas:insomnio:migraña:
:LOGBOOK:
CLOCK: [2018-10-12 vie 14:12]--[2018-10-12 vie 14:17] =>  0:05
:END:
segundo dia no dormi muy bien con ultradispositivo, pq me desperte con
ultramigraña a las 4am y se notan las dos verdes, estoy como boleado,
me tome un migral entero con cuatro tragos de licuado y me volvi a
dormir, y me costo despertarme pero no considero que dormi tan bien
como ayer p.e. que no puse despertador. Me desperte a las 8.am.
La Cami vino retemprano, mejor pq empezo bien y temprano. Yo me
levante desayune y conte el dinero, fui al banco, y volvi lave un poco
de platos con dificultad, y pense en seguir limpiando a fondo y me
decidi por meterle al encarpetado de los documentos.
Lo inicialize yo, y luego lo siguio la cami, invitamos a la Romi a
comer, y la Cami se fue con su amiga, y me quede con la Romi, comimos
juntos, y encarpeto ella el segundo muy bien!!!. Tengo los dos
encarpetados y al dia. O sea metimos 600 documentos en carpeta en un
solo saque. Ahora me falta llevar los papeles. Sigo con ansiedad cero,
y me parece que la relacion con las hijas aca fluye de otra forma lo
que estoy mas relajado en cuanto a horarios.
**** TODO objetivo acomodar los archivos de orgmode :orgmode:minimalizacion:
:LOGBOOK:
CLOCK: [2018-10-12 vie 14:18]--[2018-10-12 vie 14:19] =>  0:01
:END:
lo puedo hacer en cualquier lado, es algo divertido y a la vez es util
para que rinda mejor el esfuerzo.
*** 2018-10-13 sábado
**** mala experiencia con helm :orgmode:emacs:
:LOGBOOK:
CLOCK: [2018-10-13 sáb 15:31]--[2018-10-13 sáb 15:34] =>  0:03
:END:
para desinstalar en otras maquinas desinstale emacs y volvi a
instalar, y en la notebook no hizo falta, directamente borre el
directorio .emacs.d/ y luego reinstale todos los paquetes que uso y
quedo una instalacion limpia de nuevo.
prefiero usar asi. Helm era muy invasivo, incomprensible y estorbaba
en la asignacion de tags en orgmode.
*** 2018-10-14 domingo
**** solo en la cabaña estaba tranquilo :ansiedad:CE:findes:matetes:libertad:
:LOGBOOK:
CLOCK: [2018-10-14 dom 12:35]--[2018-10-14 dom 12:47] =>  0:12
:END:
Noto que aca en el marques no estoy tranquilo sino que estoy a la
espera. pq se espera que hagamos algo. En vez de disfrutar el tiempo
libre como mas te plazca y rascarte los huevos a cuatro manos y hacer
lo que te venga a la gana, mas alla que alla estabas en el campo y
entonces ya le quitabas "el elemento" que te rompe las pelotas
cronicamente en la vida o sea que no salis, pq ya estas en estado de
salido, o sea vivis salido, entonces no tenes que salir, vos vivis
tranquilo, si quieren visitarte que vengan a verte, y como la
distancia es lo suficientemente larga eso hace que cada uno haga su
vida y no te rompan las pelotas. Lo unico que te causaba problemas
eran las chicas que no les gustaba pq querian salir a otro lado y asi
sucesivamente.
Pero aca me siento siempre ante la obligacion que o bien falta algo en
el sentido siguiente:
1. que no "salimos a algun lado"
   - el problema es que desde mi punto de vista esta es "la salida a
     mi semana" o sea no me siento muy con ganas de un plan de salir
     desde aca a otro lado.
2. que tenemos que incluir dentro del fin de semana una actividad con
   el Fede y la familia.
   - no solo que me caga a veces el tema de esa indecision de no saber
     cuando es la "juntada" o que es demasiado larga, o que no me
     gusta o etc. y a lo mejor queda como obligada y no se sienten
     comodos conmigo
3. que hay alguna cuestion de "negocios" que quedo por tratar.
   - como costumbrismo siempre decimos el finde lo terminamos de
     definir y lo que menos hacemos el finde es trabajar juntos, lo
     cual esta bien, y termino a veces frustrado pq a lo mejor no se
     hablo o no se trabajo nada mas que cinco minutos, y se podria
     mejor trabajar dentro de la semana.
PD: este domingo siendo el medio de un finde largo es peor pq vino la
consuegrada y cometimos el error estrategico de no ir a saludar apenas
vinieron, y quedo una seudoinvitacion del fede para ir a comer, y
hasta ahora no se han hecho presente, y eso en el fondo te tiene las
bolas al plato, pq ni siquiera quiero ir para alla, y encima viene ih
que la del super le dice "van a ir a algun lado??"
**** avance bastante en aprendizaje y en arreglo :findes:orgmode:
:LOGBOOK:
CLOCK: [2018-10-14 dom 17:32]--[2018-10-14 dom 17:38] =>  0:06
:END:
Como dos caracteristicas muy grandes que hice en esta siesta tengo la
instalacion de un navegador interno de emacs muy potente, que creo
agilizara por diez la tarea de cualquier tipo que se trate, el w3m, y
toda la puesta a punto del encriptamiento de nodos con el aprendizaje
de la clave GPG tanto en generacion, en backupeado, en exportacion,
luego importacion a otras maquinas, y posibilidad de tener en el git
en forma transparente los orgs con los nodos mezclados tanto los
abiertos como los pgpeados.
Antes de eso trabaje bastante sobre el tema de Archivo que permite ir
guardando y desactivando los org viejos que molestan pero que son
lindos guardarlos, y ya manejo bien el refile, y los capture template,
agregue otro template para habit.
No he avanzado tanto en achurar archivos pero eso es la parte facil.
**** NEXT objetivo de estudio y forma de realizarlo :estudio:orgmode:emacs:OBJ:
:LOGBOOK:
CLOCK: [2018-10-14 dom 17:38]--[2018-10-14 dom 17:40] =>  0:02
:END:
Creo que la forma de realizar la incorporacion definitiva y plasmada
de los conocimientos para llegar al fondo de la cuestion es la
impresion por capitulos separados como hice con orgmode y su
correspondiente lectura y asimilacion completa. pq eso luego lleva a
su aplicacion he incorporacion a la base de datos actual.
**** sigo con dolor en implante y sangrado encia :implantes:sintomas:
:LOGBOOK:
CLOCK: [2018-10-14 dom 22:22]--[2018-10-14 dom 22:23] =>  0:01
:END:
sigue el dolor en el mismo nivel, parece encia, y ahora sangra al
lavar los dientes pero no mucho.
**** tres SL un domingo!! :findes:ansiedad:
:LOGBOOK:
CLOCK: [2018-10-14 dom 22:23]--[2018-10-14 dom 22:29] =>  0:06
:END:
desde esta manana que me agarro el ataque de ansiedad cuando ih vino
del minisol y dijo que si no ibamos a algun lado y de ahi analize todo
respecto al fin de semana, y estar esperando a Godot, tome el primer
SL. Luego me pase la siesta super bien, aunque tome medio migral, con
gran avance que describi en otro post. Luego se levanta ih y cuando le
cuento todo esto o sea la teoria de que el fin de semana me pone
ansioso y porque, me pongo ansioso de tal forma que no puedo hablar
bien, y me tomo un segundo SL, y estoy todo ansioso por dentro, lo
siento en los brazos en el cuerpo entero. Y nos ponemos a ver un
capitulo de Ministerio del Tiempo, luego me pongo de nuevo en la
maquina agotando una carga de notebook pero sin tanto exito en el
resultado, y la ansiedad ahora se manifiesta con el tic de empujar los
dientes y me tomo un tercer SL. Y pienso que todo es lo mismo. Al
final un dia que tendria que ser de relax total termina siendo de
dopacion total.
**** learn/anki/drill no funciona :orgmode: 
:LOGBOOK:
CLOCK: [2018-10-14 dom 22:52]--[2018-10-14 dom 22:53] =>  0:01
:END:
 learn / drill 
 al M-x customize-variable RET org-modules RET vi que hay un modulo de
 learn con el algorritmo supermario. para ver 
 ambos dan error, no andan. que bronca.
Lo volvi a probar hoy y tampoco funciono.
*** 2018-10-15 lunes
**** formas de tagear en journal :orgmode:
:LOGBOOK:
CLOCK: [2018-10-15 lun 17:55]--[2018-10-15 lun 18:02] =>  0:07
:END:
***** usar el tag OBJ para objetivos 
cosa que siempre hacemos o hicimos, y asi podemos identificar un post
con dicho tag como objetivo, y adosarle otros tags como alimento o
ejercicio o dpto o estudio etc. para filtrar, y tambien se puede jugar
luego que uno filtre los OBJ mas recientes o activos, con TODOS> NEXT,
DESISTIDO, DONE. o sea un search muy interesante podria ser para
tag/todos OBJ/NEXT lo cual nos daria los objetivos que estariamos
trabajando y de alli concretar acciones en agenda o reformularle el
titulo para que sirvan para nextaccions.  Y de paso tendriamos una
vision a traves del tiempo de todos los objetivos como van o
permaneciendo los mismos o cambiando a traves del tiempo.
***** usar el tag RELEER para post destacados 
cuando releemos p.e. ahora que tengo que hacer refile hay post que
vale la pena destacar del resto se pueden tagear a posteriori con este
tag, cosa que no sale en el momento de escribirlo pq no sabiamos que
era una porcion memorable.
**** pasar TODOS los escritos a un solo archivo :orgmode:OBJ:matetes:
:LOGBOOK:
CLOCK: [2018-10-15 lun 18:38]--[2018-10-15 lun 18:47] =>  0:09
:END:
como es tan sencillo mediante el capture y el C-1 C-0 y con el
movimiento rapido a traves del calendario, hace que podas meter el
post dentro del arbol del journal original, y de paso tageamos bien. Y
de paso releemos en el momento, o sea no solo debe ser un trabajo
rutinario y rapido para luego leer algun dia.
Creo que la suma de poder tagear profusamente, acomodar en el arbol
cronologico, y a la vez marcar encryptado lo que sea necesario. Mas la
posibilidad de ir escribiendo abajo nuevos posts relacionados, incluso
usar links vale la pena.
*** 2018-10-16 martes
**** terminacion finde superlargo :ansiedad:findes:
:LOGBOOK:
CLOCK: [2018-10-16 mar 09:39]--[2018-10-16 mar 09:44] =>  0:05
:END:
termino el martes a la mañana un finde que empezo el viernes a la
tarde.
y fue signado por el tema de esperar que nos invitaran a comer como
habian quedado, y aunque el tema fue sacado y aclarado, aunque no
entendido en su momento causo mucho desasiego en el fin de semana y
causo mucha ansiedad y varios SL. 
En general dormi bien, curse con poco migral, y hoy a la mañana un
poco me puse ansioso por la salida pensando que no iba a conseguir
taxi pero a pesar del caos vehicular pudimos salir tranquilos.
**** limpie vestidor y mesas de luz :tareaExtra:
:LOGBOOK:
CLOCK: [2018-10-16 mar 13:10]--[2018-10-16 mar 13:16] =>  0:06
:END:
pase toda la ropa de invierno a cajas, saque bultos a llevar a
marques, limpie y acomode en cajas lo que habia en mesas de luz,
liberando un poco el caos, limpie con blem, cajon y abajo, libere
mucho espacio en sector de perchas y quedo con las camisas que puedo
llegar a usar en la temporada. Las cajas mas o menos estan
clasificadas, por temas y no estan tan colapsadas, o sea que se podria
considerar terminado el vestidor. faltaria rociarlo con antipolillas
para eliminar esas maripositas molestas. Esta tarea la hice durante la
mañana aproximadamente entre las 10.30 y las 12.30, pq no lave platos
ni tendi cama, pq pense que era mejor hacer una tarea de base y luego
seguir con lo de arribita y no seguir evadiendo la tarea de base. para
siempre. 
**** Este tag es un analisis de la organizacion en org :infoOrg:
:LOGBOOK:
CLOCK: [2018-10-16 mar 13:16]--[2018-10-16 mar 13:26] =>  0:10
:END:
Como organizar los archivos y como organizar los tags.
***** Implemente el tag tareaExtra 
para describir toda aquella tarea que haga en el dia a dia que no sea
rutinaria ni se haga siempre, siempre en funcion de hacer un sparse
tree y ver cuales y cuando fueron las tareas extras que hicimos
***** implementar las recetas como tag no como archivo extra
para que poner otro archivo, si mejor tener todo en uno y con un tag
adecuado poner la receta y luego la buscamos facilmente.
***** implemente una seccion cobradores casos con sus tags
esa seccion contendra los casos que deben seguirse y agendarse.
Eso siempre fue un pain con la base de datos y nunca lo logre, y con
esto es una papa. 
Tengo suboutines con los numeros de los cobradores con tag a los
mismos numeros, cosa que todas las tareas lo hereden, luego viene el
caso, que puede tener un schedule pq tiene que saltar con un suceso
futuro ya sea cuando vaya a cobrar o algo asi. (ahi venia el pain de
la base de datos), y abro el todo. y describo el problema.
y tageo de nuevo a la zona. Luego viene el tema o bien agenda view,
que luego podre tener programadas vistas ad-hoc para filtrar y ver o
bien las filtro a mano segun cuantas vayan siendo. Pero lo libre es
poder poner todo tipo de casos, para que quede registrado
todo. Incluso los reclamos, pendientes, etc.
**** me inocule de common lisp :freakismo:
:LOGBOOK:
CLOCK: [2018-10-16 mar 22:00]--[2018-10-16 mar 22:02] =>  0:02
:END:
y estoy distrayendome de esto hasta el punto de alejarme de lo
principal que seria terminar de organizarme en orgmode y en en el
trabajo. P.e. estoy teniendo problemas con la agenda view por cobrador
para recordar asuntos pendientes en el momento en oficina, y en crear
trabajo que valga la pena en los pocos momentos de maquina efectivo
que tengo como para tener que lidear con otra cosa nueva.
*** 2018-10-17 miércoles
**** dispositivo a toda maquina :insomnio:
:LOGBOOK:
CLOCK: [2018-10-17 mié 08:37]--[2018-10-17 mié 08:40] =>  0:03
:END:
anoche dormi muy bien a pesar de haberme despertado a cierta hora y
pensar que era hora de despertarme, y eran las 6 y pico y me volvi a
dormir. A pesar del ruido, creo que las dos verdes por ahora superan
el ruido y te permiten dormir muy bien. En especial si no has cenado
nada. 
**** un dia como cualquiera :estadoAnimico:hijas:orgmode:
:LOGBOOK:
CLOCK: [2018-10-17 mié 15:37]--[2018-10-17 mié 15:43] =>  0:06
:END:
Hoy parece que no hice mucho, pero tenia mi plancito hecho desde ayer
en mi lista (tiene que ser en smart no puede ser en emacs todavia pq
no hay integracion y no hay maquina disponible pq deje la notebook
alla). Me hice licuado, y conte y deposite, que era lo planeado y
compre migral, quedo pendiente comprar beroca por el precio. 
Luego me puse bermudas para hacer mas soportable aca dentro el trabajo
y me puse a pasar listados para ayudar a la Cami , es que el finde
largo fue fenomenal, 82k de cobranza y 200 paginas de listado a pasar
al menos, ella me compro las cosas y luego se fue. 
Lo bueno es que la relacion con ambas hijas mejoro un poco o bastante,
la comunicacion es mas fluida incluso tenemos un canal propio mas
directo. Y me hice la primera comida en serio, comi un bife con
cebolla y pure hecho en pocos minutos. 
Lo poco que lei en el banco pq fue rapido es que hay mucho para
aprender y organizarse en orgmode todavia para que podamos estar
medianamente organizados en un matete tan grande como el que
tenemos. Pq estamos queriendo facturar una pasta y estamos sin gente y
asi no se puede. Pq no hay tiempo. Pq yo trabajo todo el dia y no
tengo tiempo para nada. Pq te lleva tiempo hacer las cosas. 
**** limites entre oficina.org y programar en tcl :orgmode:programacion:
:LOGBOOK:
CLOCK: [2018-10-17 mié 22:16]--[2018-10-17 mié 22:22] =>  0:06
:END:
creo que se empieza en orgmode por la rapidez, luego se ve si la
funcion lo amerita y uno ve que hay voluntad de recopilacion de
informacion durante un tiempo razonable se programa algo en la base de
datos en forma definitiva. 
Obvio que seria bueno un CMR todo interrelacionado con todas las
funciones pero no lo tenemos y tengo esto ahora, que aunque tampoco lo
se manejar estoy mas cerca, y luego vere como puedo ir
mejorandolo. Pero por ahora recopilo informacion que sea relevante y
que se pueda recopilar no cualquier informacion porque ese es el
problema.
A veces no anotamos cosas importantisimas que van pasando o que nos
van diciendo los cobradores para hacer seguimiento, para lo cual
orgmode se presta un monton, como se presta para las anotaciones de
bitacora y estrategia en un solo archivo. Y otros registros como
cambios, y devoluciones, que antes no registrabamos. O tampoco los
documentos llevados por los cobradores, o cosas asi. Ahora todo lo
relevante esta en un solo archivo que esta abierto toda la sesion de
atencion de cobradores de dos horas.
Como estaba abierto el log de programacion durante la programacion y
alli quedo plasmada toda la historia de la programacion que hice.
Y este jornal un poco anota todo lo que hago.
**** dieta carne :alimentacion:
:LOGBOOK:
CLOCK: [2018-10-17 mié 22:22]--[2018-10-17 mié 22:25] =>  0:03
:END:
hoy comi carne mediodia y noche. No digo que voy a hacerlo todos los
dias, pero aproveche el bife fresco pq freeze la mitad nomas. Cocinar
no me supuso mucho tiempo. Las compras las hizo la Cami. 
Mañana compro de nuevo para licuado y creo que eso va a levantar mas
rapido que un frasco de beroca.
*** 2018-10-18 jueves
**** tags para clientes :idea:
:LOGBOOK:
CLOCK: [2018-10-18 jue 13:26]--[2018-10-18 jue 13:38] =>  0:12
:END:
pensar las ideas de orgmode y tratar de traducirlas para la base de
datos. 
Pensar la idea de tags. Y como un tag se puede pegar a un cliente. y
luego permitir la busqueda de ese cliente. Supongamos que un cliente
vive en Dominica 1960 entonces el tag Dominica1960 se le adosa de por
vida, eso no cambia, por mas que cambie de direccion o nada. 
Los tags se podrian representar por buttons y al presionarlos se
podria obtener un tablelist con todos los registros que comparten ese
tag y los otros tags e ir filtrando. 
Tambien se podria manejar por tag la situacion de moroso, incobrable,
o mudado, o devolvio. 
y eso permitiria analizar mejor las situaciones.
Incluso luego con los parentezcos que habria que pensar como
incluirlos como tags. 
**** reflexiones :freakismo:
:LOGBOOK:
CLOCK: [2018-10-18 jue 14:41]--[2018-10-18 jue 14:54] =>  0:13
:END:
anteayer pensaba sobre el freakismo pq me sentia atraido en la lectura
de lisp en forma pura y pensaba que esto me estaba apartando de
orgmode basico. Y luego que en el banco ayer vi como en la agenda
ponian linkeos a calendario me puse a husmear sobre holidays y me meti
a mayores vericuetos como pasa en esos casos para pasar el tiempo, pq
pasa asi, uno no lee organicamente, por eso yo propuse el otro dia,
imprimir capitulos completos para "trabajarlos de una cierta forma" y
tenerlos fisicamente a mano para poder volver a ellos y al menos
distinguir lo que seria teoria de base del boludeo de buscar la quinta
pata al gato y en este sentido fue que encontre una repuesta en
reddit:

Um, I don't really do all that. Guess I just keep track of relevant
dates in my head -- not that hard to do, and it's good exercise for
your brain. I mean, you would think that I would use some tool for
organizing time considering that I am working full-time while
constantly traveling around the world -- and yet I've yet to yet miss
a plane or a deadline at work. I don't know, my dude -- when I start a
Masters one day I will probably begin using some kind of time-tracking
system, though it will likely be paper-based. I find paper-based
systems much more useful and convenient than electronic ones -- I
don't need to constantly carry around some electronic with me (and I
don't have to bother with unlocking the device, opening the app,
forgetting to synchronize, etc. -- I just check my notepad and/or
write down my next appointment). As for note-taking, I would also
carry around a notepad and take it out when I need to, but I'd then
copy everything over into org-mode. I already am a big user of
org-mode since organizing notes and searching through them is much
easier than with a 100% paper-based solution. I guess some people want
such advantages for time-tracking too, but for me it's too much effort
and not enough reward. Okay, I guess the whole clocking your tasks in
org-mode is a nice feature -- but do you really need this? And
personally, my tasks are complex enough and intertwined enough that I
cannot really clock them in an independent way and if I were to try to
do so, the data would be mostly meaningless. But hey, everyone's
different -- and my hyper-optimized, surprisingly paper-biased
workflows may only work well for me. There's just not enough data here
to be able to give general advice and be confident that "hey, I'm
certain this applies to you!" -- no. This isn't so much advice as it
is food for thought, though it could also be advice if you think this
would be helpful to you -- in which case, please write back and let me
know if my advice was useful!

En otras palabras creo que lo que pude entender es que para que
preocuparse por lo que yo llamo la quinta pata del gato, o sea
distraerse o preocuparse por funciones que no usamos o cubrimos mejor
de otra forma si tenemos una enorme funcionalidad, gigante
funcionalidad a nuestra disposicion para hacer andar.

Por otro lado pienso que todo lo que aprendemos y leemos tiene
continua implicancia en el trabajo, pq nos van ocurriendo ideas que
pueden provenir de otros sistemas y de otras formas de hacer las cosas
que ahora no tenemos. Como la recientemente esbozada idea de tageado
de clientes, para rapida busqueda de situaciones y clasificado de
clientes. Son ideas que deben ser desarrolladas en extenso pero ya
empezaron a calar y bueno pueden ser buenas a futuro, pero por ahora
sigamos explorando, lo bueno es que no se pierde nada. 
Y no es freakismo algo que a mi me gusta.

**** avance gigante el volver a filtrar por mobile :bitacoraOficina:
:LOGBOOK:
CLOCK: [2018-10-18 jue 19:37]--[2018-10-18 jue 19:41] =>  0:04
:END:
Creo que fue un avance gigante volver a filtrar por nuestra base de
datos y con la mejora que le hice de que se vean en forma clara.
Creo que fueron muchisimos los mocos de venta que se cometieron en la
ultima pasada y todo por causa de no tener el cuidado minimo de
protegerse de la cuestion calle. Por eso pienso que la informacion es
de vital importancia pq cada frase cuenta en el momento de tomar la
decision.
**** necesidad de un F13 moderno en TCL :programacion:
:LOGBOOK:
CLOCK: [2018-10-18 jue 19:42]--[2018-10-18 jue 19:47] =>  0:05
:END:
en especial para aprobacion de creditos, con visualizacion de los
"tags" y las supraentidades o sea las casas o clanes. 
Estaria bueno un sistema de buffers tipo emacs por medio de tabs
quizas p.e. donde la info se expandiera y saliera en otro tab y se
fueran agregando los tabs, los cuales luego se podrian cerrar a
discreción con doble click. P.e. una busqueda o un detalle ampliado de
un cliente, eso limpiaria la pantalla principal.

*** 2018-10-19 viernes
**** atoramiento de improductividad :problemaCami:migraña:problemaTiempo:
:LOGBOOK:
CLOCK: [2018-10-19 vie 11:22]--[2018-10-19 vie 11:29] =>  0:07
:END:
Senti un momentaneo ataque de improductividad estando la Cami aca sin
hacer nada pq ya hizo todo temprano y creo que volvemos a caer a lo
mismo de siempre. 
***** ganamos muy poquitas rutinas
pq que rompa los papeles dia a dia, que encarpete dia a dia y asi. 
***** pero... sigo confiando en que no cometa errores
o sea no da la ecuacion del tiempo para corregir errores, o sea que si
siguen apareciendo errores se va a armar la gorda.
***** no es factible delegar tareas por mas nimias que sean
hace dos dias que tengo que comprar nueces y pasas de uva y no puedo
mandarla aca a una cuadra a que me las compre, o sea una mezcla de
autodeclarada incapacidad de ella y un poco el querer yo que no me
echen gran moco en las compras de ciertas cosas hace que no me sirva
para eso. (ya se... tendria que llevarla conmigo una vez y que vea y
luego a largo plazo ya que vaya ella.)
***** no es factible delegar cosas que son mayores o pq yo no me animo
como fue hoy ir a rapipago pq eran 20k o ir al banco menos, o bien pe
ir a poner un aviso que hay que preguntar por el numero de telefono y
quizas no lo logre y encima llueve.
***** no se presta y no es proclive a agregarse funciones en el dpto
pe me ve sacando la basura del cesto, atando la bolsa llevandola a
donde va poniendo otra bolsa, etc. u ordenando un poco el dpto asi sea
la parte del living cocina, o sea la parte dedicada a la oficina, y no
lo hace.
**** Creo que trabajo mucho :problemaTiempo:trabajo:
:LOGBOOK:
CLOCK: [2018-10-19 vie 11:30]--[2018-10-19 vie 11:37] =>  0:07
:END:
ayer a las 20hs ih escribe que recien se levanta despues de haber
vuelto del dentista y que se iba a acostar a dormir de nuevo hasta
mañana. Y yo pensaba que me habia levantado a las 7.30, no habia
dormido siesta, y recien venia de la oficina y eran casi las 21hs que
no iba a cenar, tome un "cafe" para despabilarme con cuatro pancitos
con queso para ponerme en la compu y luego me acoste con el celu en la
mano hasta las 23hs. o sea todo el dia con la cabeza puesta en el
negocio, pq nada de eso era personal, o sea qu een el fondo pienso que
estoy un poco excedido. Y quizas sea el formato de la jornada. Pero
tambien los otros formatos me han sido adversos tambien hay que
recordar. Y releer para verlo.
**** tag MALVENDIDO para ventas con errores concretos :programacion:idea:
:LOGBOOK:
CLOCK: [2018-10-19 vie 18:07]--[2018-10-19 vie 18:11] =>  0:04
:END:
se hace un log en comentarios explicando la foto en el momento como
estoy haciendo en org y se tagea como malvendido (puede ser un campo
logico ya sea en ventas o clientes ya se vera) la idea es que despues
podamos comprobar con ese tag cuantos pagaron y cuantos no. Y de paso
ir uniendo logs y creando una especie de instructivo que nos indique
cuales son los casos en los que no se debe vender. Pq en la situacion
actual de la base de dato todo queda en el olvido, se vende mal, se
borran los rastros (condonamos) no anotamos nada y despues si hay un
terrible incobrable no lo atribuimos a la mala venta.
*** 2018-10-20 sábado
**** estallido de fin de semana inexplicable contra ih :estadoAnimico:findes:ih:
:LOGBOOK:
CLOCK: [2018-10-20 sáb 15:14]--[2018-10-20 sáb 15:25] =>  0:11
:END:
Vine mal de la oficina pq  el dia habia terminado sombrio y estaba
beligerante en especial contra el Fede y ya ih se habia retirado de la
mesa y yo trataba de hablar con la Cami suavemente tratando de que
ella pudiera serme mas util, como habia expresado en post anteriores,
o sea poniendo como ejemplo la compra de nueces de ayer, que no pudo
hacerla pq no encontraba o no se animaba a encontrar el lugar, y yo en
un esfuerzo maximo de condescendencia, estaba proclive a llevarla
conmigo a que viera donde es y como compro para que pudiera ir ella
otra vez y asi serme mas util, y alli ellas dijeron que eso era asunto
privado mio que no tenia que ser pagado por el sueldo de romitex, y
que el Fede en todo caso le pagaba extra a la Cami por traerle cosas
del centro y entonces se mete la ih, y yo le dije "gorda amorfa" que
se callara y entonces quedo todo asi en la media ofensa. Y como yo no
me retracte y segui medio enojado, y hoy me pide que la lleve a alta
gracia a llevarle las plantas a la madre y a visitarla y yo no la
lleve entonces me siento mal yo y a la vez me da bronca pq me paso
toda la semana renegando por el puto negocio de mierda, y las cosas
que no funcionan y tener que venir el fin de semana un fin de semana
al menos que la Cami no sale y tener que empezar tan mal, ya cruzado y
con dos compromisos tan complejos que estan relacionados pero son
dificiles de sacar.

**** Cambio de sistema operativo :programacion:notebook:
:LOGBOOK:
CLOCK: [2018-10-20 sáb 15:28]--[2018-10-20 sáb 15:35] =>  0:07
:END:
Cambie dentro de Solus a variante Budgie, que ya la tengo en el
desktop y ahora la paso aca y me parece que esta muy buena pq no tiene
ese menu que aparece y desaparece al costado que es desconcertante y a
la vez es muy solido.
No hice encriptacion del disco entero pq ahora no estoy usando los
datos de romitex, salvo para la programacion pq trabajo con un
pendrive, y el orgblok lo tengo en un volumen encryptado en verycript
lo cual es mas seguro y a la vez facilita el arranque de la maquina y
el prestamo de la maquina. 
Tambien tengo telegram que tiene un pin de cierre en ambas maquinas. O
sea que mientras no estoy esta cerrada la aplicacion.
La instalacion fue muy rapida esta vez con las instrucciones que ya
tenia de la vez pasada.
**** buen resultado de este sabado :programacion:
:LOGBOOK:
CLOCK: [2018-10-20 sáb 23:57]--[2018-10-21 dom 00:00] =>  0:03
:END:
estoy muy conforme con el resultado de este sabado, empece y le di un
espectacular inicio al buscador del F13. Ya esta planteado el
problema. Ahora queda armarlo.
El lugar aca se presta con la nueva disposicion de la cocina al lado
del tele. mientras ih ve tele yo programo.
Un F13 nuevo va a resumir el F7 y el F13 viejo en uno nuevo.
*** 2018-10-21 domingo
**** consulta dentista :dientes:implantes:
:LOGBOOK:
CLOCK: [2018-10-21 dom 12:29]--[2018-10-21 dom 12:36] =>  0:07
:END:
ayer hice la consulta general al dentista sobre todos los temas que
tenia hasta el presente y hago este post para recordar.
***** amarilleo
dice que no amarillean facilmente y que pueden volver a lo natural con
bicarbonato o una pasta especial o una limpieza del odontologo cada
seis meses
***** bruxismo
placa de deporte que se remoja o bien hacer la placa especial cuando
tenga el turno el sabado 17/11 
***** pasta dental
la noc no es mala, pero tengo que comprar pastas que cuiden de la
encia, todas las que tengan mencion a encias ya sea oral B o sensodyne
o colgate, pero que tengan eso en la caja
***** cuidar sintomas
si entre el diente y en la encia se va formando una bolsita que se va
inflando se puede ir haciendo una infeccion con el implante
***** aftas
las aftas ovaladas se formaron con el cepillado y son mas persistentes
que las aftas comunes y pueden ser molestos y tambien sangrantes, y
pueden ser producidos por excesos en el cepillado.
***** masticacion
es normal por unos meses el tener miedo a masticar, pero no hay que
tener miedo y mas que yo tengo los dientes naturales abajo que me
permiten saber el grado de presion que estoy dando, pq con todo
implantado no se sabe la presion que se da. 
***** tic de empujar con la lengua
dice que no se aflojaran los dientes con eso
***** premolar mas atras
que se puede corregir un poco con el implante definitivo pero va a
haber un defecto pq la conformacion original de la boca era muy
deficiente en ese sitio.
**** Aprendizaje de emacslisp :estudio:freakismo:
:LOGBOOK:
CLOCK: [2018-10-21 dom 12:37]--[2018-10-21 dom 12:42] =>  0:05
:END:
Estoy leyendo el manual de emacs-lisp que aparece con emacs que lo
tengo en firefox traducido bastante bien. Y aunque no es algo que
lleve a una via concreta no deja de ser algo que va relajando en las
lecturas, idem el paso a telegram.
Tendria que pasar a teoria lo aprendido de ambos temas.
